<?php

const STATUS_DICTIONARY = [
  'BY' => [
    'N' => 'e69805ca-180e-11ea-0a80-00ae00032ace', // Новый
    'P' => '64d6a2cc-c599-11ea-0a80-03da0002a494', // Прибыл в пункт выдачи
    'SE' => 'f18d5a81-180e-11ea-0a80-00ae000335b1', // Готов к отправке
    'CL' => '2380587c-2692-11ec-0a80-076e0003f802', // Сборка
    'Pr' => 'f220d481-180e-11ea-0a80-00ae0003366f', // Передан в службу доставки
    'no' => '27402499-3126-11ea-0a80-042200001026', // Передумал/Ошибка
    'F' => 'e3dc8a9f-180e-11ea-0a80-00ae00032820', // Выполнен
    'OS' => 'f1220651-180e-11ea-0a80-00ae00033543', // Нет в наличии
    'rp' => '0c9d2d08-9c1b-11ea-0a80-04f400034a03', // Возврат прибыл в ПВЗ
    'TA' => 'f1130c2c-180e-11ea-0a80-00ae00033533', // Самовывоз
    'CO' => 'f2609449-180e-11ea-0a80-00ae000336ae', // Готов к доставке
    'RD' => 'e9564c5b-180e-11ea-0a80-00ae00032d13', // Возврат после вручения
    'NA' => 'e9c19580-180e-11ea-0a80-00ae00032d6c', // Не удалось дозвониться
    'FB' => '35be5783-1a98-11eb-0a80-02350004d5f8', // Выполнен, без смс
    'NZ' => 'f62c4d87-180e-11ea-0a80-00ae000339e0', // Отказ на этапе доставки
    'CR' => 'e3b43800-180e-11ea-0a80-00ae000327ff', // Выдан курьеру на доставку
    'CS' => 'e52aa602-180e-11ea-0a80-00ae00032977', // Отменен (Магазин)
    'R' => '61a8534a-c599-11ea-0a80-03da0002a3ff', // Возврат в пути
    'DK' => '554560f9-5715-11eb-0a80-07750004ebc1', // Доставлен курьером
    'SC' => 'bec47348-bfa4-11f0-0a80-1be9001df106', // Продолжаем дозваниваться,
    'PW' => 'f544eaca-daf2-11ee-0a80-04df00ed2d4b', // Ожидает в ПВЗ
  ],
  'RU' => [
    'N' => '2ff6b54f-3c86-11f0-0a80-1a9700374081', // Новый
    'P' => '30ab4ad4-3c86-11f0-0a80-1a9700374123', // Прибыл в пункт выдачи
    'SE' => '312a0c7b-3c86-11f0-0a80-1a9700374185', // Готов к доставке
    'CL' => '31df1886-3c86-11f0-0a80-1a97003741b0', // Сборка
    'Pr' => 'b74f3eca-0adb-11ea-0a80-0042000ab6d1', // Передан в службу доставки
    'no' => '26ebfd74-3c87-11f0-0a80-1320007a4cda', // Передумал/Ошибка
    'F' => '2862e3f9-3c87-11f0-0a80-1320007a4e5c', // Выполнен
    'OS' => 'd4fb40b4-3cca-11f0-0a80-1410000d480c', // Нет в наличии
    'rp' => 'e0d3105a-3cca-11f0-0a80-1410000d5658', // Возврат прибыл в ПВЗ
    'TA' => '03d1483d-3d53-11f0-0a80-1325003afbf7', // Самовывоз
    'CO' => '99fa66b1-3d56-11f0-0a80-1687005d92cd', // Готов к доставке
    'RD' => 'b74f47bb-0adb-11ea-0a80-0042000ab6da', // Возврат после вручения
    'NA' => 'b74f4888-0adb-11ea-0a80-0042000ab6db', // Не удалось дозвониться
    'NZ' => 'b74f46c4-0adb-11ea-0a80-0042000ab6d9', // Отказ на этапе доставки
    'CR' => 'b74f4049-0adb-11ea-0a80-0042000ab6d2', // Выдан курьеру на доставку
    'CS' => 'b74f4f6d-0adb-11ea-0a80-0042000ab6e3', // Отменен (Магазин)
    'R' => 'b74f431b-0adb-11ea-0a80-0042000ab6d5', // Возврат в пути
    'DK' => '2e565714-a10a-11eb-0a80-0292002f3488', // Доставлен курьером
    'SC' => 'edd3d6f0-bfa4-11f0-0a80-0c2d001edcdf', // Продолжаем дозваниваться,
    'PW' => 'b74f4242-0adb-11ea-0a80-0042000ab6d4', // Ожидает в ПВЗ
  ],
];
 ?>
